---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.FabricAreaType
source: html/4dcd257f-6c57-a940-13d9-0f8a67476122.htm
---
# FabricAreaType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.